<a href="https://colab.research.google.com/github/zakiahintan/Kelas_Dasar/blob/main/M4P1V2_Pengenalan_Pandas_DataFrame.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Pandas DataFrame

Pandas adalah Library analisis data yang memiliki struktur data yang diperlukan untuk membersihkan data mentah ke dalam sebuah bentuk yang cocok untuk analisis (yaitu tabel). Pandas melakukan tugas penting seperti menyelaraskan data untuk perbandingan dan penggabungan set data, penanganan data yang hilang, dll

## Import Modul

In [ ]:
import pandas as pd

## Membuat DataFrame
**Membuat Matriks Menggunakan List**

In [ ]:
# List
list_buah = ['Jeruk', 'Pepaya', 'Mangga', 'Rambutan', 'Leci', 'Nanas', 'Manggis']
  
# Membuat DataFrame menggunakan list_buah
df = pd.DataFrame(list_buah)
df

          0
0     Jeruk
1    Pepaya
2    Mangga
3  Rambutan
4      Leci
5     Nanas
6   Manggis

**Membuat Data Frame Menggunakan List dan Fungsi Zip**

In [ ]:
# List Buah (string)
list_buah = ['Jeruk', 'Pepaya', 'Mangga', 'Rambutan', 'Leci', 'Nanas', 'Manggis']
  
# List Berat Buah (Integer)
list_berat = [50, 800, 150, 10, 2, 300, 70]
  
# Membuat dataframe menggunakan Dua Buah List dengan Fungsi Zip
df = pd.DataFrame(list(zip(list_buah, list_berat)),
               columns =['Nama Buah', 'Berat Buah'])
df

  Nama Buah  Berat Buah
0     Jeruk          50
1    Pepaya         800
2    Mangga         150
3  Rambutan          10
4      Leci           2
5     Nanas         300
6   Manggis          70

**Membuat DataFrame Menggunakan List Multidimensi**

In [ ]:
# List Multidimensi (Nama, Usia) 
lst = [['Bejo', 25], ['Ari', 30],
       ['Asep', 26], ['Richard', 22]]
    
df = pd.DataFrame(lst, columns =['Nama', 'Usia'])
df

      Nama  Usia
0     Bejo    25
1      Ari    30
2     Asep    26
3  Richard    22

**Membuat Dataframe Menggunakan Dictionary**

Cara yang paling mudah dipahami untuk membuat dataframe adalah menggunakan input dictionary. Yang mana key akan menjadi nama kolom dan valuenya akan menjadi data dalam kolom tersebut(biasanya berupa list). Strukturnya adalah sebagai berikut:
```
data = {'Nama Kolom 1': ['Data Baris 1', 'Data Baris 2', ...],
        'Nama Kolom 2': ['Data Baris 1', 'Data Baris 2', ...],
         ...
        }
df = pd.DataFrame (data)
```

In [ ]:
mobil = {'Type Mobil': ['Honda Civic','Toyota Corolla','Ford Focus','Audi A4'],
        'Harga(USD)': [22000,25000,27000,35000]
        }

df = pd.DataFrame(mobil)

df

       Type Mobil  Harga(USD)
0     Honda Civic       22000
1  Toyota Corolla       25000
2      Ford Focus       27000
3         Audi A4       35000

## Mengimport DataFrame

Kamu dapat mengimpor dataframe dari file berupa tabel lainnya seperti .xls, .xlsx, .csv, .txt, dan .json.

### Import DataFrame dari File CSV

In [ ]:
df_super_store = pd.read_csv('/content/Super-Store-Dataset.csv')
df_super_store.head()

### Import DataFrame dari File Excel

In [ ]:
df_pilkada=pd.read_excel('/content/datasetpilkadadki.xlsx')
df_pilkada.head()

## DataFrame & Series
Di Pandas terdapat 2 kelas data baru yang digunakan sebagai struktur dari spreadsheet:

1. **Series**
2. **DataFrame**

In [ ]:
# Series
number_series = pd.Series([1,2,3,4,5,5])
print("Series:")
number_series

Series:

0    1
1    2
2    3
3    4
4    5
5    5
dtype: int64

In [ ]:
# DataFrame
matrix = [[1,2,3],
          ['a','b','c'],
          [3,4,5],
          ['d',4,6]]

matrix_df = pd.DataFrame(matrix)

matrix_df

   0  1  2
0  1  2  3
1  a  b  c
2  3  4  5
3  d  4  6

### Atribut DataFrame & Series
Dataframe dan Series memiliki sangat banyak atribut yang digunakan untuk transformasi data, tetapi ada beberapa attribute yang sering dipakai.

In [ ]:
df_super_store

**1. Atrribute .head()**

Atrribute .head() untuk melihat 5(default dan bisa dirubah) data teratas pada dataframe.

In [ ]:
df_super_store.head()

**2. Attribute .tail()**

Attribute .tail() untuk melihat 5(default dan bisa dirubah) data teratas pada dataframe.

In [ ]:
df_super_store.tail()

**3. Attribute .info()**

Attribute .info() digunakan untuk mengecek kolom apa yang membentuk dataframe itu, data types, berapa yang non null, dll. Attribute ini tidak dapat digunakan pada series, hanya pada data frame saja

In [ ]:
df_super_store.info()

**4. Attribute .shape**

Attribute .shape digunakan untuk mengetahui berapa baris dan kolom, hasilnya dalam format tuple (baris, kolom).

In [ ]:
df_super_store.shape

**5. Attribute .dtypes**

Attribute .dtypes digunakan untuk mengetahui tipe data di tiap kolom. Tipe data object: kombinasi untuk berbagai tipe data (number & text, etc).

In [ ]:
df_super_store.dtypes

**6. Attribute .astype(nama_tipe_data)**

Attribute .astype(nama_tipe_data) untuk convert tipe data berdasarkan tipe data seperti: **float, int, str, numpy.float, numpy.int** ataupun **numpy.datetime**.

In [ ]:
df_str = df_super_store.astype("str")
df_str.head()

In [ ]:
df_str.dtypes

**8. Attribute .to_list()**

Attribute .to_list() digunakan untuk mengubah series menjadi list dan tidak dapat digunakan untuk dataframe.

In [ ]:
print(number_series.to_list())

[1, 2, 3, 4, 5, 5]

**9. Attribute .unique()**

Attribute .unique() digunakan menghasilkan nilai unik dari suatu kolom, hasilnya dalam bentuk numpy array. Attribute ini hanya digunakan pada series saja.

In [ ]:
print(number_series.unique())

[1 2 3 4 5]

**10. Attribute .index**

Attribute .index digunakan untuk mencari index/key dari Series atau Dataframe.

In [ ]:
df_super_store.index

**11. Attribute .columns**

Attribute .columns digunakan untuk mengetahui apa saja kolom yang tersedia di dataframe tersebut (hanya digunakan untuk dataframe saja).

In [ ]:
df_super_store.columns

**12. Attribute .counts()**

Attribute .count() untuk menghitung jumlah data pada masing-masing kolom.

In [ ]:
df_super_store.count()

**13. Attribute .value_counts**

Attribute .value_counts digunakan untuk mengetahui jumlah data kategori unik pada setiap kolom

In [ ]:
df_pilkada.head()

In [ ]:
df_pilkada.Sentiment.value_counts()

**14. Attribute .describe()**

Attribute .describe() digunakan untuk menampilkan ringkasan statistik data numerik pada sebuah dataframe

In [ ]:
df_super_store.describe()